In [1]:
import numpy as np # NumPy
import pandas as pd # Pandas

# IPython( jupyter notebook ) 디스플레이 설정 변경
# 출력할 열의 개수 한도 설정
pd.set_option( 'display.max_columns', 20 )
# 출력할 열의 너비 설정
pd.set_option( 'display.max_colwidth', 20 )
# 유니코드 사용 너비 조정
pd.set_option( 'display.unicode.east_asian_width', True )

# 경고( warnings ) 메시지 출력 방지
import warnings
warnings.filterwarnings( 'ignore' )

In [3]:
titanic_df = pd.read_csv('data/titanic.csv')
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen...",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. Jo...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss....",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. J...",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. Willi...",male,35.0,0,0,373450,8.0500,NaN,S

# 함수 매핑(function mapping)
## 개별 원소에 함수 매핑
### 시리즈 객체의 원소에 함수 매핑

In [4]:
df = titanic_df.loc[:, ['Age','Fare']]
df['ten'] = 10
df.head()

    Age     Fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [5]:
# 함수 매핑에 사용할 사용자 정의 함수
def add_10(x):
    return x + 10

def add_two_obj(x,y):
    return x+y

In [6]:
# 'Age' 변수에 add_10() 함수 매핑
#       - return -> add_10() 리턴값을 각 원소에 적용
sr1 = df['Age'].apply(add_10)
sr1.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: Age, dtype: float64

In [8]:
# 'Age' 변수에 add_two_obj() 함수와 y인수 매핑
#       - return -> add_two_obj() 리턴값을 각 원소에 적용
sr1 = df['Age'].apply(add_two_obj, y = 20)
sr1.head()

0    42.0
1    58.0
2    46.0
3    55.0
4    55.0
Name: Age, dtype: float64

### 데이터프레임 객체의 원소에 함수 매핑

In [9]:
df_map = df.applymap(add_10)
df_map.head()

    Age     Fare  ten
0  32.0  17.2500   20
1  48.0  81.2833   20
2  36.0  17.9250   20
3  45.0  63.1000   20
4  45.0  18.0500   20

## 시리즈 객체에 함수 매핑
### 데이터프레임 각 열( 변수, 시리즈 객체 ) 에 함수 매핑

In [10]:
df = titanic_df.loc[:,['Age','Fare']]
df.head()

    Age     Fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [14]:
# 함수 매핑에 사용할 사용자 정의 함수
def missing_value(series): # 인수 : series 객체
    return series.isnull() # series 객체에 대한 처리 결과

In [12]:
result = df.apply(missing_value)
result.head()

     Age   Fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

In [15]:
type(result)

pandas.core.frame.DataFrame

In [16]:
result.sum()

Age     177
Fare      0
dtype: int64

In [17]:
def min_max(x):
    return x.max() - x.min()

In [18]:
result = df.apply(min_max)
result.head()

Age      79.5800
Fare    512.3292
dtype: float64

### 데이터프레임 각 행(데이터)에 함수 매핑

In [19]:
df['ten'] = 10
df.head()

    Age     Fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [21]:
df['add'] = df.apply(lambda x : add_two_obj(x['Age'], x['ten']), axis = 1)
df.head()
# add 에 Age + ten
# lambda 함수는 이름이 없고 하나의 표현식으로 함수를 정의

    Age     Fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0

In [22]:
map_func = lambda x : add_two_obj(x['Age'], x['ten'])
df['add'] = df.apply(map_func, axis = 1)
df.head()

    Age     Fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0

### 데이터프레임 객체 함수 매핑

In [23]:
df = titanic_df.loc[:,['Age', 'Fare']]
df.head()

    Age     Fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [25]:
# 각 열의 NaN 찾기 - 데이터프레임을 전달하면 데이터프레임 반환
def missing_value(x):
    return x.isnull()

#  각 열의 NaN 개수 계산 - 데이터프레임을 전달하면 시리즈 반환
def missing_count(x):
    return missing_value(x).sum()

# 총 NaN 개수 계산 - 데이터프레임을 전달하면 값 반환
def total_number_missing(x):
    return missing_count(x).sum()

In [26]:
# 데이터프레임이 반환
result = df.pipe(missing_value)
result.head()

     Age   Fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

In [27]:
type(result)

pandas.core.frame.DataFrame

In [29]:
result = df.pipe(missing_count)
result.head()

Age     177
Fare      0
dtype: int64

In [30]:
result = df.pipe(total_number_missing)
result

177

In [31]:
type(result)

numpy.int64

# 열(변수) 재구성
## 열(변수) 순서 변경

In [32]:
df = titanic_df.loc[0:4, 'Survived':'Age']
df.head()

   Survived  Pclass                 Name     Sex   Age
0         0       3  Braund, Mr. Owen...    male  22.0
1         1       1  Cumings, Mrs. Jo...  female  38.0
2         1       3  Heikkinen, Miss....  female  26.0
3         1       1  Futrelle, Mrs. J...  female  35.0
4         0       3  Allen, Mr. Willi...    male  35.0

In [33]:
# 1. 데이터프레임 열(변수) 이름을 파이썬 리스트에 저장
columns = list(df.columns.values)
columns

['Survived', 'Pclass', 'Name', 'Sex', 'Age']

In [36]:
# 2. 원하는 순서로 열을 재배치
columns_sorted = sorted(columns) # 알파벳순으로 변경

# 3. 재배치된 열을 데이터프레임에 적용
df_sorted = df[columns_sorted]
df_sorted.head()

    Age                 Name  Pclass     Sex  Survived
0  22.0  Braund, Mr. Owen...       3    male         0
1  38.0  Cumings, Mrs. Jo...       1  female         1
2  26.0  Heikkinen, Miss....       3  female         1
3  35.0  Futrelle, Mrs. J...       1  female         1
4  35.0  Allen, Mr. Willi...       3    male         0

In [38]:
# 1. 원하는 순서에 맞게 열(변수) 이름을 리스트에 저장
columns = ['Pclass', 'Sex', 'Age', 'Survived']

# 2. 재배치된 열을 데이터프레임에 적용
df_sorted = df[columns]
df_sorted.head()

   Pclass     Sex   Age  Survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

## 열(변수) 분리

In [39]:
df = pd.read_csv('data/stock-data.csv')
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [40]:
df['Date'] = pd.to_datetime(df['Date'])
df.head()

        Date  Close  Start   High    Low  Volume
0 2018-07-02  10100  10850  10900  10000  137977
1 2018-06-29  10700  10550  10900   9990  170253
2 2018-06-28  10400  10900  10950  10150  155769
3 2018-06-27  10900  10800  11050  10500  133548
4 2018-06-26  10800  10900  11000  10700   63039

In [41]:
df.dtypes

Date      datetime64[ns]
Close              int64
Start              int64
High               int64
Low                int64
Volume             int64
dtype: object

In [44]:
df['Date'] = df['Date'].astype('str')
# 데이터프레임의 obhject type 변수에는 str 속성(attribute)이 있다.
dates = df['Date'].str.split('-')
dates.head()

0    [2018, 07, 02]
1    [2018, 06, 29]
2    [2018, 06, 28]
3    [2018, 06, 27]
4    [2018, 06, 26]
Name: Date, dtype: object

In [45]:
df['년'] = dates.str.get(0)
df['월'] = dates.str.get(1)
df['일'] = dates.str.get(2)
df.head()

         Date  Close  Start   High    Low  Volume    년  월  일
0  2018-07-02  10100  10850  10900  10000  137977  2018  07  02
1  2018-06-29  10700  10550  10900   9990  170253  2018  06  29
2  2018-06-28  10400  10900  10950  10150  155769  2018  06  28
3  2018-06-27  10900  10800  11050  10500  133548  2018  06  27
4  2018-06-26  10800  10900  11000  10700   63039  2018  06  26

## 필터링(filtering)
## 불린 인덱싱(boolean indexing)

In [46]:
mask = (titanic_df.Age >= 10) & (titanic_df.Age < 20)
mask.head()

0    False
1    False
2    False
3    False
4    False
Name: Age, dtype: bool

In [47]:
df_teenage = titanic_df.loc[mask, :]
df_teenage.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
9,10,1,2,"Nasser, Mrs. Nic...",female,14.0,1,0,237736,30.0708,NaN,C
14,15,0,3,"Vestrom, Miss. H...",female,14.0,0,0,350406,7.8542,NaN,S
22,23,1,3,"McGowan, Miss. A...",female,15.0,0,0,330923,8.0292,NaN,Q
27,28,0,1,"Fortune, Mr. Cha...",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
38,39,0,3,"Vander Planke, M...",female,18.0,2,0,345764,18.0000,NaN,S

In [49]:
# 10세 미만의 여자 아이
mask = (titanic_df.Age < 10) & (titanic_df.Sex == 'female')
df_female_under10 = titanic_df.loc[mask, :]
df_female_under10.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
10,11,1,3,"Sandstrom, Miss....",female,4.0,1,1,PP 9549,16.7000,G6,S
24,25,0,3,"Palsson, Miss. T...",female,8.0,3,1,349909,21.0750,NaN,S
43,44,1,2,"Laroche, Miss. S...",female,3.0,1,2,SC/Paris 2123,41.5792,NaN,C
58,59,1,2,"West, Miss. Cons...",female,5.0,1,2,C.A. 34651,27.7500,NaN,S
119,120,0,3,"Andersson, Miss....",female,2.0,4,2,347082,31.2750,NaN,S

## isin() 메서드

In [50]:
mask1 = titanic_df['SibSp'] == 3
mask2 = titanic_df['SibSp'] == 4
mask3 = titanic_df['SibSp'] == 5

df_boolean = titanic_df[mask1 | mask2 | mask3]
df_boolean.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master....",male,2.0,3,1,349909,21.0750,NaN,S
16,17,0,3,"Rice, Master. Eu...",male,2.0,4,1,382652,29.1250,NaN,Q
24,25,0,3,"Palsson, Miss. T...",female,8.0,3,1,349909,21.0750,NaN,S
27,28,0,1,"Fortune, Mr. Cha...",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
50,51,0,3,"Panula, Master. ...",male,7.0,4,1,3101295,39.6875,NaN,S

In [51]:
isin_filter = titanic_df['SibSp'].isin([3,4,5])

df_isin = titanic_df[isin_filter]
df_isin.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master....",male,2.0,3,1,349909,21.0750,NaN,S
16,17,0,3,"Rice, Master. Eu...",male,2.0,4,1,382652,29.1250,NaN,Q
24,25,0,3,"Palsson, Miss. T...",female,8.0,3,1,349909,21.0750,NaN,S
27,28,0,1,"Fortune, Mr. Cha...",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
50,51,0,3,"Panula, Master. ...",male,7.0,4,1,3101295,39.6875,NaN,S

## 데이터프레임 합치기
### 데이터프레임 연결

In [55]:
df1 = pd.DataFrame({'a':['a0','a1','a2','a3'],
                   'b':['b0','b1','b2','b3'],
                   'c':['c0','c1','c2','c3']},
                  index = [0,1,2,3])
df2 = pd.DataFrame({'a':['a0','a1','a2','a3'],
                   'b':['b0','b1','b2','b3'],
                   'c':['c0','c1','c2','c3'],
                   'd':['d0','d1','d2','d3']},
                  index = [1,2,3,4])

print(df1,'\n\n',df2)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

     a   b   c   d
1  a0  b0  c0  d0
2  a1  b1  c1  d1
3  a2  b2  c2  d2
4  a3  b3  c3  d3

In [56]:
# 데이터프레임 위/아래 방향으로 연결 - 행 방향 연결
result = pd.concat([df1, df2])
result

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
1  a0  b0  c0   d0
2  a1  b1  c1   d1
3  a2  b2  c2   d2
4  a3  b3  c3   d3

In [57]:
# 데이터프레임 위/아래 방향으로 연결 - 행 방향 연결, 인덱스 번호는 새로 부여
result = pd.concat([df1, df2], ignore_index = True)
result

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a0  b0  c0   d0
5  a1  b1  c1   d1
6  a2  b2  c2   d2
7  a3  b3  c3   d3

In [58]:
# 데이터프레임 우측 방향으로 연결 - 열 방향 연결
result = pd.concat([df1, df2], axis = 1)
result

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1   a0   b0   c0   d0
2   a2   b2   c2   a1   b1   c1   d1
3   a3   b3   c3   a2   b2   c2   d2
4  NaN  NaN  NaN   a3   b3   c3   d3

In [59]:
# 데이터프레임 우측 방향으로 연결 - 열 방향 연결
# join = 'inner' : 연결할 데이터프레임의 행 인덱스가 교집합을 기준으로 연결
result = pd.concat([df1, df2], axis = 1, join = 'inner')
result

    a   b   c   a   b   c   d
1  a1  b1  c1  a0  b0  c0  d0
2  a2  b2  c2  a1  b1  c1  d1
3  a3  b3  c3  a2  b2  c2  d2

## 데이터프레임 병합

In [62]:
df1 = pd.read_excel('data/stock price.xlsx') # master 성격(기본 정보)
df2 = pd.read_excel('data/stock valuation.xlsx') # detail 성격

print( df1, '\n\n', df2)

       id    stock_name          value   price
0  128940      한미약품   59385.666667  421000
1  130960        CJ E&M   58540.666667   98900
2  138250    엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280  녹십자엠에스     468.833333   10200
5  145990        삼양사   82750.000000   82000
6  185750        종근당   40293.666667  100500
7  192400    쿠쿠홀딩스  179204.666667  177500
8  199800          툴젠   -2514.333333  115400
9  204210  모두투어리츠    3093.333333    3475

        id              name           eps     bps        per       pbr
0  130960            CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480              하림    274.166667    3551  11.489362  0.887074
2  138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480            이마트  18268.166667  295780  13.931338  0.860437
4  145990            삼양사   5741.000000  108090  14.283226  0.758627
5  161390        한국타이어   5648.500000   51341   7.453306  0.820007
6  181710   NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
7  185750            종근당   3990.333333   40684  25.185866  2.470259
8  204210      모두투어리츠     85.166667    5335  40.802348  0.651359
9  207940  삼성바이오로직스   4644.166667   60099  89.790059  6.938551

In [64]:
# 교집합 - df1, df2에 공통으로 존재하는 id 변수를 기준으로 merge
merge_inner = pd.merge(df1, df2)
merge_inner

,id,stock_name,value,price,name,eps,bps,per,pbr
0,130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068,15.695091,1.829178
1,139480,이마트,239230.833333,254500,이마트,18268.166667,295780,13.931338,0.860437
2,145990,삼양사,82750.000000,82000,삼양사,5741.000000,108090,14.283226,0.758627
3,185750,종근당,40293.666667,100500,종근당,3990.333333,40684,25.185866,2.470259
4,204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335,40.802348,0.651359

In [66]:
# how = 'outer' : 병합 기준이 어느 한 쪽에 있다면 병합
# on = 'id' : 병합 기준 변수
merge_outer = pd.merge(df1, df2, how='outer', on = 'id')
merge_outer

,id,stock_name,value,price,name,eps,bps,per,pbr
0,128940,한미약품,59385.666667,421000.0,NaN,NaN,NaN,NaN,NaN
1,130960,CJ E&M,58540.666667,98900.0,CJ E&M,6301.333333,54068.0,15.695091,1.829178
2,138250,엔에스쇼핑,14558.666667,13200.0,NaN,NaN,NaN,NaN,NaN
3,139480,이마트,239230.833333,254500.0,이마트,18268.166667,295780.0,13.931338,0.860437
4,142280,녹십자엠에스,468.833333,10200.0,NaN,NaN,NaN,NaN,NaN
5,145990,삼양사,82750.000000,82000.0,삼양사,5741.000000,108090.0,14.283226,0.758627
6,185750,종근당,40293.666667,100500.0,종근당,3990.333333,40684.0,25.185866,2.470259
7,192400,쿠쿠홀딩스,179204.666667,177500.0,NaN,NaN,NaN,NaN,NaN
8,199800,툴젠,-2514.333333,115400.0,NaN,NaN,NaN,NaN,NaN
9,204210,모두투어리츠,3093.333333,3475.0,모두투어리츠,85.166667,5335.0,40.802348,0.651359
10,136480,NaN,NaN,NaN,하림,274.166667,3551.0,11.489362,0.887074
11,138040,NaN,NaN,NaN,메리츠금융지주,2122.333333,14894.0,6.313806,0.899691
12,161390,NaN,NaN,NaN,한국타이어,5648.500000,51341.0,7.453306,0.820007
13,181710,NaN,NaN,NaN,NHN엔터테인먼트,2110.166667,78434.0,30.755864,0.827447
14,207940,NaN,NaN,NaN,삼성바이오로직스,4644.166667,60099.0,89.790059,6.938551

In [68]:
# how = 'left' : 왼쪽 데이터프레임을 기준으로 병합
# left_on = 'stock_name' : 왼쪽 데이터프레임의 기준 변수
# right_on = 'name' : 오른쪽 데이터프레임의 기준 변수
merge_left = pd.merge(df1, df2, how = 'left',
                     left_on = 'stock_name', right_on = 'name')
merge_left

,id_x,stock_name,value,price,id_y,name,eps,bps,per,pbr
0,128940,한미약품,59385.666667,421000,NaN,NaN,NaN,NaN,NaN,NaN
1,130960,CJ E&M,58540.666667,98900,130960.0,CJ E&M,6301.333333,54068.0,15.695091,1.829178
2,138250,엔에스쇼핑,14558.666667,13200,NaN,NaN,NaN,NaN,NaN,NaN
3,139480,이마트,239230.833333,254500,139480.0,이마트,18268.166667,295780.0,13.931338,0.860437
4,142280,녹십자엠에스,468.833333,10200,NaN,NaN,NaN,NaN,NaN,NaN
5,145990,삼양사,82750.000000,82000,145990.0,삼양사,5741.000000,108090.0,14.283226,0.758627
6,185750,종근당,40293.666667,100500,185750.0,종근당,3990.333333,40684.0,25.185866,2.470259
7,192400,쿠쿠홀딩스,179204.666667,177500,NaN,NaN,NaN,NaN,NaN,NaN
8,199800,툴젠,-2514.333333,115400,NaN,NaN,NaN,NaN,NaN,NaN
9,204210,모두투어리츠,3093.333333,3475,204210.0,모두투어리츠,85.166667,5335.0,40.802348,0.651359

In [69]:
# 불린 인덱싱을 이용한 데이터프레임 생성
price = df1[df1['price']<50000]
price

       id    stock_name         value  price
2  138250    엔에스쇼핑  14558.666667  13200
4  142280  녹십자엠에스    468.833333  10200
9  204210  모두투어리츠   3093.333333   3475

In [70]:
# 불린 인덱싱으로 생성된 데이터프레임과 df2를 병합 - 교집합
value = pd.merge(price,df2)
value

,id,stock_name,value,price,name,eps,bps,per,pbr
0,204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335,40.802348,0.651359

# 그룹 연산
## 그룹 객체 만들기( 분할 단계 )

In [71]:
df = titanic_df.loc[:,['Age','Sex','Pclass','Fare','Survived']]

df.head()

    Age     Sex  Pclass     Fare  Survived
0  22.0    male       3   7.2500         0
1  38.0  female       1  71.2833         1
2  26.0  female       3   7.9250         1
3  35.0  female       1  53.1000         1
4  35.0    male       3   8.0500         0

In [72]:
print(f'승객수 : {len(df)}')

승객수 : 891

In [75]:
# 'Pclass' 변수를 기준으로 그룹 분할
grouped = df.groupby(['Pclass'])
grouped

In [76]:
for key, group in grouped:
    print(f'* key : {key}')
    print(f'* number : {len(group)}')
    print(group.head(), '\n')

* key : 1
* number : 216
     Age     Sex  Pclass     Fare  Survived
1   38.0  female       1  71.2833         1
3   35.0  female       1  53.1000         1
6   54.0    male       1  51.8625         0
11  58.0  female       1  26.5500         1
23  28.0    male       1  35.5000         1

* key : 2
* number : 184
     Age     Sex  Pclass     Fare  Survived
9   14.0  female       2  30.0708         1
15  55.0  female       2  16.0000         1
17   NaN    male       2  13.0000         1
20  35.0    male       2  26.0000         0
21  34.0    male       2  13.0000         1

* key : 3
* number : 491
    Age     Sex  Pclass     Fare  Survived
0  22.0    male       3   7.2500         0
2  26.0  female       3   7.9250         1
4  35.0    male       3   8.0500         0
5   NaN    male       3   8.4583         0
7   2.0    male       3  21.0750         0

### 적용 단계

In [77]:
average = grouped.mean()
average

              Age       Fare  Survived
Pclass
1       38.233441  84.154687  0.629630
2       29.877630  20.662183  0.472826
3       25.140620  13.675550  0.242363

In [78]:
grouped = df.groupby(['Pclass','Sex'])
for key, group in grouped:
    print(f'* key : {key}')
    print(f'* number : {len(group)}')
    print(group.head(), '\n')

* key : (1, 'female')
* number : 94
     Age     Sex  Pclass      Fare  Survived
1   38.0  female       1   71.2833         1
3   35.0  female       1   53.1000         1
11  58.0  female       1   26.5500         1
31   NaN  female       1  146.5208         1
52  49.0  female       1   76.7292         1

* key : (1, 'male')
* number : 122
     Age   Sex  Pclass      Fare  Survived
6   54.0  male       1   51.8625         0
23  28.0  male       1   35.5000         1
27  19.0  male       1  263.0000         0
30  40.0  male       1   27.7208         0
34  28.0  male       1   82.1708         0

* key : (2, 'female')
* number : 76
     Age     Sex  Pclass     Fare  Survived
9   14.0  female       2  30.0708         1
15  55.0  female       2  16.0000         1
41  27.0  female       2  21.0000         0
43   3.0  female       2  41.5792         1
53  29.0  female       2  26.0000         1

* key : (2, 'male')
* number : 108
     Age   Sex  Pclass  Fare  Survived
17   NaN  male       2  13.0         1
20  35.0  male       2  26.0         0
21  34.0  male       2  13.0         1
33  66.0  male       2  10.5         0
70  32.0  male       2  10.5         0

* key : (3, 'female')
* number : 144
     Age     Sex  Pclass     Fare  Survived
2   26.0  female       3   7.9250         1
8   27.0  female       3  11.1333         1
10   4.0  female       3  16.7000         1
14  14.0  female       3   7.8542         0
18  31.0  female       3  18.0000         0

* key : (3, 'male')
* number : 347
     Age   Sex  Pclass     Fare  Survived
0   22.0  male       3   7.2500         0
4   35.0  male       3   8.0500         0
5    NaN  male       3   8.4583         0
7    2.0  male       3  21.0750         0
12  20.0  male       3   8.0500         0

In [79]:
average = grouped.mean()
average

                     Age        Fare  Survived
Pclass Sex
1      female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
2      female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
3      female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

## 결합

In [80]:
# df : 피벗 테이블 작성 데이터프레임
# index = 'Pclass' : 행(index) 위치에 들어갈 변수
# columns = 'Sex' : 열(변수) 위치에 들어갈 변수
# values = 'Age' : 원소(값) 위치에 들어갈 변수
# aggfunc = 'mean' : 데이터 집계 함수
pdf = pd.pivot_table(df, index = 'Pclass', columns = 'Sex', values = 'Age', aggfunc = 'mean')
pdf

Sex        female       male
Pclass
1       34.611765  41.281386
2       28.722973  30.740707
3       21.750000  26.507589

In [81]:
pdf = pd.pivot_table(df, index = 'Pclass', columns = 'Sex', values = 'Age', aggfunc = 'max')
pdf

Sex     female  male
Pclass
1         63.0  80.0
2         57.0  70.0
3         63.0  74.0